[
  {
    "joke": "A woman walks into a library and asked if they had any books about paranoia. The librarian says \"They're right behind you!\"",
    "categories": ["wtf", "general"]
  },
  {
    "joke": "The other day, my wife asked me to pass her lipstick but I accidentally passed her a glue stick. She still isn't talking to me.",
    "categories": ["general"]
  },
  {
    "joke": "I know a lot of jokes about unemployed people but none of them work.",
    "categories": ["general"]
  },
  {
    "joke": "Your life can't fall apart if you never had it together!",
    "categories": ["quotes"]
  },
  {
    "joke": "Life without you is like a broken pencil... pointless.",
    "categories": ["pickup"]
  },
  {
    "joke": "What has 36 teeth and holds back the Incredible Hulk? My zipper.",
    "categories": ["pickup", "nsfw"]
  },
  {
    "joke": "Even if there wasn't gravity on earth, I'd still fall for you.",
    "categories": ["pickup"]
  },
  {
    "joke": "People say nothing is impossible, but I do nothing every day.",
    "categories": ["quotes"]
  },
  {
    "joke": "As I suspected, someone has been adding soil to my garden. The plot thickens.",
    "categories": ["general"]
  },
  {
    "joke": "And the lord said unto John, \"Come forth and you will receive eternal life\". John came fifth and won a toaster.",
    "categories": ["general"]
  },
  {
    "joke": "On a scale from 1 to 10, you're a 9... And I'm the 1 you need.",
    "categories": ["pickup"]
  },
  {
    "joke": "Did You Hear The Story About The Cheese That Saved The World?",
    "categories": ["general"]
  },
  {
    "joke": "I was gonna tell you a joke about UDP... but you might not get it.",
    "categories": ["programming"]
  },
  {
    "joke": "To understand recursion... you must first understand reursion",
    "categories": ["programming"]
  },
  {
    "joke": "Why do programmers always mix up Halloween and Christmas? Because Oct 31 == Dec 25",
    "categories": ["programming"]
  },
  {
    "joke": "Life is short, smile while you still have teeth.",
    "categories": ["quotes"]
  },
  {
    "joke": "People say nothing is impossible, but I do nothing every day.",
    "categories": ["quotes"]
  },
  {
    "joke": "If you think nobody cares if you're alive, try missing a couple of payments.",
    "categories": ["quotes"]
  },
  {
    "joke": "Do you like sales? Because if you're looking for a good one, clothing is 100% off at my place.",
    "categories": ["pickup"]
  },
  {
    "joke": "Does your left eye hurt? Because you’ve been looking right all day.",
    "categories": ["pickup"]  
  },
  {
    "joke": "I thought Happiness starts with H. But why does mine starts with U.",
    "categories": ["pickup"]
  }
]

